In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
a = [0, 2, 4, 6, 8]
b = [1, 3, 5, 7, 9]
print(a,b)

[0, 2, 4, 6, 8] [1, 3, 5, 7, 9]

In [4]:
a = 10 #int
b = (1.44,'bitamin') #tuple
c = "비타민" #str
d = [1, 2, 3, 4, 5] #list
e = {'특별시':'천안','충남':'서울','인천':'광역시'} #dict
print(type(a),type(b),type(c),type(d),type(e))

<class 'int'> <class 'tuple'> <class 'str'> <class 'list'> <class 'dict'>

In [6]:
score = [90,25,67,45,80]  
for i in range(5):
    if score[i] >= 80:
        print("우수")
    elif score[i] >= 60:
        print("보통")
    else:
        print("미흡")

우수
미흡
보통
미흡
우수

In [23]:
import seaborn as sns  
titanic=sns.load_dataset('titanic')
titanic.head(3)

df = titanic.loc[:,['pclass','fare']]
df

     pclass     fare
0         3   7.2500
1         1  71.2833
2         3   7.9250
3         1  53.1000
4         3   8.0500
..      ...      ...
886       2  13.0000
887       1  30.0000
888       3  23.4500
889       1  30.0000
890       3   7.7500

[891 rows x 2 columns]

   pclass      fare
0       3  0.014151
1       1  0.139136
2       3  0.015469

In [28]:
df = pd.read_csv("C:/Users/User/Desktop/비타민/지원 관련/비타민 코테 기출/insurance2.csv")
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

In [31]:
pd.isnull(df).sum()

age          0
sex          0
bmi         17
children     0
smoker       0
region       0
charges      0
dtype: int64

In [36]:
df.fillna(method='ffill',inplace = True)
pd.isnull(df).sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64